"""
    Делу — время, потехе — час

Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

Формат ввода
    Одно натуральное число N

Формат вывода
    N строк с фразой: "Купи слона!"
"""

number = int(input())
string = "Купи слона!"
print((string + "\n") * number)
